
# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

from math import sqrt
list1=[2,555,443,456,144,36]
list2=[]
for i in list1:
    a=float(i)
    a=sqrt(a)
    if a==int(a):
        list2.append(int(a))
print(list1,'\n',list2)
    
# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

a=input("введите дд.мм.гггг")
chislo=['первое', 'второе', 'третье', 'четвёртое',
        'пятое', 'шестое', 'седьмое', 'восьмое',
        'девятое', 'десятое', 'одиннадцатое', 'двенадцатое',
        'тринадцатое', 'четырнадцатое', 'пятнадцатое', 'шестнадцатое',
        'семнадцатое', 'восемнадцатое', 'девятнадцатое', 'двадцатое',
        'двадцать первое', 'двадцать второе', 'двадцать третье',
        'двадацать четвёртое', 'двадцать пятое', 'двадцать шестое',
        'двадцать седьмое', 'двадцать восьмое', 'двадцать девятое',
        'тридцатое', 'тридцать первое']

mesyaz=['января', 'февраля', 'марта', 'апреля', 'мая', 'июня',
           'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря']
if a[0]!='0':
    chi=chislo[int(a[:2])-1]
else: chi=chislo[int(a[1])-1]

if a[3]!='0':
    mes=mesyaz[int(a[3:5])-1]
else: mes=mesyaz[int(a[4])-1]

print(chi," ",mes," ",a[6:11]," года")



# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

from random import randint
b=int(input('введите количество чисел'))
list1=[]
j=1
while j<=b:
    list1.append(randint(-100,100))
    j+=1
print (list1)

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]


#a
lst = [1, 2, 4, 5, 6, 2, 5, 2]
lst2=set(lst)
print(lst2)

#б
lst2=[]
for n in set(lst):
    lst.remove(n)
    if (n in lst) == False:
        lst2.append(n)
        
print(lst2)
